na423-hw8-flatPlate/flatPlate-test-SA/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 3.e-6;

boundaryField
{
    inlet
    {
        type           fixedValue;
        value          uniform 3.0e-6;
    }

    "outlet|top"
    {
        type            zeroGradient;
    }

    plate  
    {
        type           nutUSpaldingWallFunction;
        //type           nutLowReWallFunction;
        value          uniform 0;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
