na423-hw8-flatPlate/flatPlate-test-SA/0/y
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      y;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
40000
(
0.000334973
0.000334973
0.000334973
0.000334973
0.000334973
0.000334973
0.000334973
0.000334973
...
)
;

boundaryField
{
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
2.9
2.9
2.9
2.9
2.9
2.9
2.9
2.9
...
)
;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
0.00725773
0.0073204
0.00744811
0.00764206
0.00790189
0.00822595
0.0086116
0.00905562
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
0.00725773
0.0073204
0.00744811
0.00764206
0.00790189
0.00822595
0.0086116
0.00905562
...
)
;
    }
    plate
    {
        type            calculated;
        value           uniform 1e-15;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
